package com.hm.nio;

/**
 * @author shishun.wang
 * @date 上午11:59:05 2017年4月5日
 * @version 1.0
 * @describe
 */
public enum BankCallbackCodeEnum {

	a00("00","成功"),
	aA6("A6","有缺陷的成功"),
	a01("01","交易失败。详情请咨询95516 "),
	a02("02","系统未开放或暂时关闭，请稍后再试"),
	a03("03","交易通讯超时，请发起查询交易"),
	a04("04","交易状态未明，请查询对账结果"),
	a05("05","交易已受理，请稍后查询交易结果"),
	a06("06","系统繁忙，请稍后再试"),
	a10("10","报文格式错误"),
	a11("11","验证签名失败"),
	a12("12","重复交易"),
	a13("13","报文交易要素缺失"),
	a14("14","批量文件格式错误"),
	a30("30","交易未通过，请尝试使用其他银联卡支付或联系95516"),
	a31("31","商户状态不正确"),
	a32("32","无此交易权限"),
	a33("33","交易金额超限"),
	a34("34","查无此交易"),
	a35("35","原交易不存在或状态不正确"),
	a36("36","与原交易信息不符"),
	a37("37","已超过最大查询次数或操作过于频繁"),
	a38("38","银联风险受限"),
	a39("39","交易不在受理时间范围内"),
	a40("40","绑定关系检查失败"),
	a41("41","批量状态不正确，无法下载"),
	a42("42","扣款成功但交易超过规定支付时间"),
	a43("43","无此业务权限，详情请咨询95516"),
	a44("44","输入卡号错误或暂未开通此项业务，详情请咨询95516"),
	a60("60","交易失败，详情请咨询您的发卡行"),
	a61("61","输入的卡号无效，请确认后输入"),
	a62("62","交易失败，发卡银行不支持该商户，请更换其他银行卡"),
	a63("63","卡状态不正确"),
	a64("64","卡上的余额不足"),
	a65("65","输入的密码、有效期或CVN2有误，交易失败"),
	a66("66","持卡人身份信息或手机号输入不正确，验证失败"),
	a67("67","密码输入次数超限"),
	a68("68","您的银行卡暂不支持该业务，请向您的银行或95516咨询"),
	a69("69","您的输入超时，交易失败"),
	a70("70","交易已跳转，等待持卡人输入"),
	a71("71","动态口令或短信验证码校验失败"),
	a72("72","您尚未在{}银行网点柜面或个人网银签约加办银联无卡支付业务，请去柜面或网银开通或拨打{}"),
	a73("73","支付卡已超过有效期"),
	a74("74","扣款成功，销账未知"),
	a75("75","扣款成功，销账失败"),
	a76("76","需要验密开通"),
	a77("77","银行卡未开通认证支付"),
	a78("78","发卡行交易权限受限，详情请咨询您的发卡行"),
	a79("79","此卡可用，但发卡行暂不支持短信验证"),
	a80("80","交易失败，Token已过期"),
	a82("82","需要校验密码"),
	a98("98","文件不存在"),
	a99("99","通用错误");


	
	private BankCallbackCodeEnum(String code,String desc){
		this.code = code;
		this.desc = desc;
	}
	
	private String code;
	
	private String desc;
	
	
	public static String trance(String code){
		for(BankCallbackCodeEnum value:BankCallbackCodeEnum.values()){
			if(value.code.equals(code)){
				return value.desc;
			}
		}
		return null;
	}
}
